<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#1.-Extracting-Data-from-API" data-toc-modified-id="1.-Extracting-Data-from-API-1">1. Extracting Data from API</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Overview-of-the-steps-in-this-Project:" data-toc-modified-id="Overview-of-the-steps-in-this-Project:-1.0.1">Overview of the steps in this Project:</a></span><ul class="toc-item"><li><span><a href="#i.-In-this-project,-data-about-crashes-from-2021-across-the-US-is-extracted-from-NHTSA-API-https://crashviewer.nhtsa.dot.gov/CrashAPI." data-toc-modified-id="i.-In-this-project,-data-about-crashes-from-2021-across-the-US-is-extracted-from-NHTSA-API-https://crashviewer.nhtsa.dot.gov/CrashAPI.-1.0.1.1">i. In this project, data about crashes from 2021 across the US is extracted from NHTSA API-<a href="https://crashviewer.nhtsa.dot.gov/CrashAPI" rel="nofollow" target="_blank">https://crashviewer.nhtsa.dot.gov/CrashAPI</a>.</a></span></li><li><span><a href="#ii.-The-API-has-a-limit-of-upto-5000-records-in-one-pull.-Hence-the-data-is-pulled-in-multiple-iterations-and-they-are-pulled-in-such-a-way-there-is-no-data-loss." data-toc-modified-id="ii.-The-API-has-a-limit-of-upto-5000-records-in-one-pull.-Hence-the-data-is-pulled-in-multiple-iterations-and-they-are-pulled-in-such-a-way-there-is-no-data-loss.-1.0.1.2">ii. The API has a limit of upto 5000 records in one pull. Hence the data is pulled in multiple iterations and they are pulled in such a way there is no data loss.</a></span></li><li><span><a href="#iii.-All-the-extracted-data-is-then-combined-and-then-transformations-are-applied-to-the-data." data-toc-modified-id="iii.-All-the-extracted-data-is-then-combined-and-then-transformations-are-applied-to-the-data.-1.0.1.3">iii. All the extracted data is then combined and then transformations are applied to the data.</a></span></li></ul></li><li><span><a href="#Creating-dataframes-using-Dynamic-variables-for-each-API-Call" data-toc-modified-id="Creating-dataframes-using-Dynamic-variables-for-each-API-Call-1.0.2">Creating dataframes using Dynamic variables for each API Call</a></span></li></ul></li></ul></li><li><span><a href="#2.-Transformations" data-toc-modified-id="2.-Transformations-2">2. Transformations</a></span><ul class="toc-item"><li><span><a href="#Transformation-1:-Concatenate-Dataframes" data-toc-modified-id="Transformation-1:-Concatenate-Dataframes-2.1">Transformation 1: Concatenate Dataframes</a></span></li><li><span><a href="#Transformation-2:-Checking-for-Nulls" data-toc-modified-id="Transformation-2:-Checking-for-Nulls-2.2">Transformation 2: Checking for Nulls</a></span></li><li><span><a href="#Transformation-3:-Change-column-names-to-upper-case" data-toc-modified-id="Transformation-3:-Change-column-names-to-upper-case-2.3">Transformation 3: Change column names to upper case</a></span></li><li><span><a href="#Transformation-4:-Convert-to-number" data-toc-modified-id="Transformation-4:-Convert-to-number-2.4">Transformation 4: Convert to number</a></span></li><li><span><a href="#Transformation-5:-Convert-to-Upper-Case" data-toc-modified-id="Transformation-5:-Convert-to-Upper-Case-2.5">Transformation 5: Convert to Upper Case</a></span></li><li><span><a href="#Transformation-6:-Adding-new-column-by-extracting-county-number" data-toc-modified-id="Transformation-6:-Adding-new-column-by-extracting-county-number-2.6">Transformation 6: Adding new column by extracting county number</a></span></li><li><span><a href="#Transformation-7:-Cleansing-CountyName-using-Regex" data-toc-modified-id="Transformation-7:-Cleansing-CountyName-using-Regex-2.7">Transformation 7: Cleansing CountyName using Regex</a></span></li><li><span><a href="#Transformation-8:-Cleansing-Date" data-toc-modified-id="Transformation-8:-Cleansing-Date-2.8">Transformation 8: Cleansing Date</a></span></li><li><span><a href="#Transformation-9:-Converting-Epoch-Date-to-Timestamp" data-toc-modified-id="Transformation-9:-Converting-Epoch-Date-to-Timestamp-2.9">Transformation 9: Converting Epoch Date to Timestamp</a></span></li><li><span><a href="#Transformation-10:-Changing-the-timestamp-format-and-order-of-columns" data-toc-modified-id="Transformation-10:-Changing-the-timestamp-format-and-order-of-columns-2.10">Transformation 10: Changing the timestamp format and order of columns</a></span></li><li><span><a href="#Transformation-11:-GroupBy-and-Sort-Transformations" data-toc-modified-id="Transformation-11:-GroupBy-and-Sort-Transformations-2.11">Transformation 11: GroupBy and Sort Transformations</a></span></li><li><span><a href="#Transformation-12:-GroupBy-and-Sort-Transformations-on-Crash-Date" data-toc-modified-id="Transformation-12:-GroupBy-and-Sort-Transformations-on-Crash-Date-2.12">Transformation 12: GroupBy and Sort Transformations on Crash Date</a></span></li></ul></li><li><span><a href="#3.-Displaying-data-of-the-final-dataframe" data-toc-modified-id="3.-Displaying-data-of-the-final-dataframe-3">3. Displaying data of the final dataframe</a></span></li><li><span><a href="#4.-Ethical-Implications" data-toc-modified-id="4.-Ethical-Implications-4">4. Ethical Implications</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#a.-Maximum-number-of-vehicles-involved-in-the-accident-is-restricted-to-six-vehicles.-Hence,-this-study-does-not-include-crashes-that-involved-more-than-6-vehicles-and-pileups.-This-should-be-taken-into-consideration-while-deriving-conclusions-from-the-research." data-toc-modified-id="a.-Maximum-number-of-vehicles-involved-in-the-accident-is-restricted-to-six-vehicles.-Hence,-this-study-does-not-include-crashes-that-involved-more-than-6-vehicles-and-pileups.-This-should-be-taken-into-consideration-while-deriving-conclusions-from-the-research.-4.0.0.1">a. Maximum number of vehicles involved in the accident is restricted to six vehicles. Hence, this study does not include crashes that involved more than 6 vehicles and pileups. This should be taken into consideration while deriving conclusions from the research.</a></span></li><li><span><a href="#b.-All-the-rows-in-the-dataset-represents-the-crashes-that-had-atleast-one-fatality.-Hence-the-research-does-not-include-the-details-of-non-fatal-accidents.-The-grim-results--of-this-research-must-be-studied-with-empathy." data-toc-modified-id="b.-All-the-rows-in-the-dataset-represents-the-crashes-that-had-atleast-one-fatality.-Hence-the-research-does-not-include-the-details-of-non-fatal-accidents.-The-grim-results--of-this-research-must-be-studied-with-empathy.-4.0.0.2">b. All the rows in the dataset represents the crashes that had atleast one fatality. Hence the research does not include the details of non-fatal accidents. The grim results  of this research must be studied with empathy.</a></span></li><li><span><a href="#c.-Some-crashes-did-not-had-include-the-time-of-crash-and-hence-they-were-replaced-with-default-values.-There-were-about-300-such-instances.-Hence,-the-results-cannot-be-derived-only-based-on-the-time-of-crash-as-about-1%-of-data-contains-default-values." data-toc-modified-id="c.-Some-crashes-did-not-had-include-the-time-of-crash-and-hence-they-were-replaced-with-default-values.-There-were-about-300-such-instances.-Hence,-the-results-cannot-be-derived-only-based-on-the-time-of-crash-as-about-1%-of-data-contains-default-values.-4.0.0.3">c. Some crashes did not had include the time of crash and hence they were replaced with default values. There were about 300 such instances. Hence, the results cannot be derived only based on the time of crash as about 1% of data contains default values.</a></span></li></ul></li></ul></li></ul></li></ul></div>

# Extracting data from API

In [1]:
# Importing the Required libraries 
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import os
import re
from datetime import datetime
from bs4 import BeautifulSoup
import requests
import urllib.request,urllib.parse,urllib.error
import ssl
import json

In [2]:
# Setting global options for the notebook such as maxrows
pd.set_option('display.max_columns', 50)
pd.set_option('display.max_colwidth', None)
pd.set_option("display.max_rows", 50)
import warnings
warnings.filterwarnings('ignore')

## 1. Extracting Data from API

#### Overview of the steps in this Project:
##### i. In this project, data about crashes from 2021 across the US is extracted from NHTSA API-https://crashviewer.nhtsa.dot.gov/CrashAPI.
##### ii. The API has a limit of upto 5000 records in one pull. Hence the data is pulled in multiple iterations and they are pulled in such a way there is no data loss.
##### iii. All the extracted data is then combined and then transformations are applied to the data.

In [3]:
# Defining the base url to pull the crash API Data
base_url="https://crashviewer.nhtsa.dot.gov/CrashAPI/crashes/GetCaseList?"
# The states are combined in such a way there is no data loss and also the number of records pulled 
# does not exceed 5000. Data from some states such as California, Texas are pulled by themselves due to 
# large number of records. Details about the state indices are present in the API documentation.
list_of_state_iters=[
    "1,2,4,5,8,9,10,11,15,16,18",
    "6", # California
    "12", # Florida
    "13,17,19,20,21,23,30",
    "22,24,25,26,27,28,29",
    "31,32,33,34,35,37,38,39",
    "36,40,41,42,44,45,46",
    "47,49,50,51,53,54,55,56",
    "48" # Texas
     ]

In [4]:
def create_crash_url(idx3):
    """
    This function will loop through the state list and generate the URL for each API call. 
    It takes the index of iteration as an input and returns the URL
    """
    # Extracting each item in the state iters list
    state_list=list_of_state_iters[idx3]
    # Setting up parameters to be used in the API. 
    fromYear=2021
    toYear=2021
    minNumOfVehicles=1
    # Maximum number of vehicles involved in crash are set to 6
    maxNumOfVehicles=6
    output_format="json"
    params={'fromYear':fromYear,'toYear':toYear,"minNumOfVehicles":minNumOfVehicles,
            "maxNumOfVehicles":maxNumOfVehicles,"format":output_format,"states":state_list}
    # Framing the url for API call using the base url and Parameters used above
    crash_url=base_url+urllib.parse.urlencode(params)
    return crash_url

In [5]:
def extract_API_Data(crash_url):
    """
    This function is used to extract the data from the crash API. This wil be called multiple times as the
    API limit is set to 5000. 
    The function return the data in JSON format along with number of records in each call.
    """
    # Including the API call within try-except call 
    try:
        # Getting the API response using urllib
        url_response=urllib.request.urlopen(crash_url)
    # Handling HTTPError exceptions
    except urllib.error.HTTPError as error1:
        print("Sorry could not retrieve the crash details. Pleasae try again!")
        return None
    # Handling URLError Exceptions
    except urllib.error.URLError as error2:
        print("Failed to reach the server")
        print(f"Reason: {error2.reason}" )
    # If there are no exceptions, proceeding to processing the extracted data
    else:
        url_data=url_response.read()
        # Reading the data in JSON format
        json_data=json.loads(url_data)
        # Reading the responses in Message and Count variables
        message=json_data['Message']
        ret_count=json_data['Count']
        ret_count=int(ret_count)
        # Checking for success message and validating if the data pull was successful
        if (message=="Results returned successfully") & (ret_count > 0) :
            print(f"Data Retrieval success! {ret_count} values successfully retrieved from the API Call")
            # If the data pull was success, returning the data for further processing
            return json_data["Results"][0],ret_count
        # If the data pull was not successful, return None
        else:
            print(f"Error!Something is not right! Please recheck the inputs!")
            return None,None

In [6]:
def create_dataframe(idx3):
    """
    This function extracts all the required field from API response and creates Dataframe 
    from the data extracted from API. It takes the index of iteration as an input and returns the URL.
    """
    # Calling create URL function to create crash URL for each iteration.
    crash_url=create_crash_url(idx3)
    # Extracting the data from API with the URL created in above step
    try:
        API_results_data,extracted_count=extract_API_Data(crash_url)
    except TypeError:
        print("None Data returned from API!")
        return None
    # Validating the number of records pulled and the number returned by the API. 
    # Also checking if the response is not None
    if (len(API_results_data)==extracted_count) & (extracted_count != None) :
        # These are the fields that the API returns
        field_list=["CountyName","CrashDate","Fatals","Peds","Persons","St_Case","State","StateName","TotalVehicles"]
        # Creating a dataframe with random numbers with the number of Rows equal to the number of records returned by the 
        # API call. number of columns is the number of fields in the Field list
        crash_API_df1=pd.DataFrame(np.random.rand(extracted_count,len(field_list)),columns=field_list)
        # Populating the dataframe with the data extracted from the API by looping through the number of rows extracted.
        for idx1 in range(extracted_count):
            # For each row in the API call, each row in the dataframe is replaced.
            for idx2,field in enumerate(field_list):
                    # Using the pandas iloc to identify the row and column index to substitute the values
                    crash_API_df1.iloc[idx1,idx2]=API_results_data[idx1][field]
        # Returning the formatted Dataframe
        return crash_API_df1
    # If the counts from the API response does not match or if it is None, throws an error
    else:
        print("Extracted count does not match with the count of records in dataset! Please verify!")
        return None

#### Creating dataframes using Dynamic variables for each API Call

In [7]:
# Getting the number of items in the states iters list. 
list_of_state_iters_len=len(list_of_state_iters)
# Looping through the number of items in the list. An API call will be made for each iteration.
for idx3 in range(list_of_state_iters_len):
    if create_dataframe(idx3) is not None:
        # Creating tables using dynamic variable in the format API_df_<index number> starting from 0 through 8
        globals()[f"API_rawDF_{idx3}"]=create_dataframe(idx3)
        # Printing confirmation message
        print(f"Created Dataframe #{idx3+1}")
        # Assigning name attribute for each dataframe
        globals()[f"API_rawDF_{idx3}"].name=f"API_rawDF_{idx3}"
    else:
        print("None Object Returned! Exiting!")
        exit(1)

Data Retrieval success! 4922 values successfully retrieved from the API Call
Data Retrieval success! 4922 values successfully retrieved from the API Call
Created Dataframe #1
Data Retrieval success! 3971 values successfully retrieved from the API Call
Data Retrieval success! 3971 values successfully retrieved from the API Call
Created Dataframe #2
Data Retrieval success! 3446 values successfully retrieved from the API Call
Data Retrieval success! 3446 values successfully retrieved from the API Call
Created Dataframe #3
Data Retrieval success! 4667 values successfully retrieved from the API Call
Data Retrieval success! 4667 values successfully retrieved from the API Call
Created Dataframe #4
Data Retrieval success! 4953 values successfully retrieved from the API Call
Data Retrieval success! 4953 values successfully retrieved from the API Call
Created Dataframe #5
Data Retrieval success! 4604 values successfully retrieved from the API Call
Data Retrieval success! 4604 values successfully retrieved from the API Call
Created Dataframe #6
Data Retrieval success! 4780 values successfully retrieved from the API Call
Data Retrieval success! 4780 values successfully retrieved from the API Call
Created Dataframe #7
Data Retrieval success! 4026 values successfully retrieved from the API Call
Data Retrieval success! 4026 values successfully retrieved from the API Call
Created Dataframe #8
Data Retrieval success! 4057 values successfully retrieved from the API Call
Data Retrieval success! 4057 values successfully retrieved from the API Call
Created Dataframe #9

## 2. Transformations

### Transformation 1: Concatenate Dataframes

In [8]:
# All the extracted Dataframes are combined together using Pandas Concat function, by ignoring indexes.
API_concat_rawDF=pd.concat([API_rawDF_0, API_rawDF_1,API_rawDF_2,API_rawDF_3,API_rawDF_4,API_rawDF_5,API_rawDF_6,
          API_rawDF_7,API_rawDF_8],ignore_index=True)
API_concat_rawDF.name="API_concat_rawDF"
print(f"The Shape of Combined Dataframe {API_concat_rawDF.name} is {API_concat_rawDF.shape}")

The Shape of Combined Dataframe API_concat_rawDF is (39426, 9)

In [9]:
# Printing last 5 rows from the Combined dataframe
API_concat_rawDF.tail()

,CountyName,CrashDate,Fatals,Peds,Persons,St_Case,State,StateName,TotalVehicles
39421,DALLAS (113),/Date(1639275300000-0500)/,1.0,1.0,1.0,484151.0,48.0,Texas,1.0
39422,HARRIS (201),/Date(1638079200000-0500)/,1.0,0.0,2.0,484152.0,48.0,Texas,2.0
39423,RUNNELS (399),/Date(1618696080000-0400)/,1.0,0.0,4.0,484153.0,48.0,Texas,2.0
39424,BEXAR (29),/Date(1622213760000-0400)/,1.0,0.0,3.0,484154.0,48.0,Texas,2.0
39425,BEXAR (29),/Date(1627749180000-0400)/,1.0,1.0,1.0,484155.0,48.0,Texas,1.0

### Transformation 2: Checking for Nulls

In [10]:
def check_Nulls(df,col):
    """
    This function checks the number of nulls in a columnof dataframe.
    Input: Takes the name of dataframe and the column name
    Returns: The count of nulls in the column
    """
    col_nan=df[col].isnull().sum()
    print(f"The column {col} has {col_nan} nulls")

In [11]:
for col in API_concat_rawDF.columns:
    check_Nulls(API_concat_rawDF,col)

The column CountyName has 0 nulls
The column CrashDate has 0 nulls
The column Fatals has 0 nulls
The column Peds has 0 nulls
The column Persons has 0 nulls
The column St_Case has 0 nulls
The column State has 0 nulls
The column StateName has 0 nulls
The column TotalVehicles has 0 nulls

### Transformation 3: Change column names to upper case

In [12]:
def colnames_toUpper(df):
    """
    This function takes Dataframe name as input and converts the Column names to UPPER Case.
    """
    # Looping through each columns
    for col in df.columns:
        # Doing a inplace replace to convert column names to Upper case
        df.rename(columns = {col:col.upper()}, inplace = True)
    return df

In [13]:
# Calling the function to convert the column names to Upper case.
API_concat_rawDF=colnames_toUpper(API_concat_rawDF)
print(f"The columns of {API_concat_rawDF.name} are : {API_concat_rawDF.columns}")

The columns of API_concat_rawDF are : Index(['COUNTYNAME', 'CRASHDATE', 'FATALS', 'PEDS', 'PERSONS', 'ST_CASE',
       'STATE', 'STATENAME', 'TOTALVEHICLES'],
      dtype='object')

### Transformation 4: Convert to number

In [14]:
def convert_to_number(df,col):
    """
    This function takes dataframe name and column name as input and converts the values to Number. 
    It performs an inplace update.
    """
    df[col]=df[col].astype(int)

In [15]:
# Creating a list of columns that contains Numeric values
number_cols=["FATALS","PEDS","PERSONS","ST_CASE","STATE","TOTALVEHICLES"]
# Looping through the list of numeric columns to convert the values to number
for col in number_cols:
    convert_to_number(API_concat_rawDF,col)

In [16]:
# Printing sample rows to validate the Number conversion
API_concat_rawDF.head()

,COUNTYNAME,CRASHDATE,FATALS,PEDS,PERSONS,ST_CASE,STATE,STATENAME,TOTALVEHICLES
0,ST. CLAIR (115),/Date(1613185800000-0500)/,2,0,3,10001,1,Alabama,2
1,JEFFERSON (73),/Date(1613084400000-0500)/,2,0,2,10002,1,Alabama,1
2,JEFFERSON (73),/Date(1612675200000-0500)/,1,1,1,10003,1,Alabama,1
3,SHELBY (117),/Date(1612387200000-0500)/,1,0,1,10004,1,Alabama,1
4,JEFFERSON (73),/Date(1612063200000-0500)/,1,0,4,10005,1,Alabama,2

### Transformation 5: Convert to Upper Case

In [17]:
def toUpper(df,col):
    """
    This fnction converts all the values in the given column of dataframe to Upper case and removes extra spaces from the string..
    Inputs: Dataframe name and Column Name.
    Performs an inplace update by converting to Upper case and removing extra spaces.
    """
    try:
        # Using apply method to convert to UpperCase and strip spaces.
        df[col]=df[col].apply(str.strip)
        df[col]=df[col].apply(str.upper)
    except TypeError:
        pass

In [18]:
# Creating a list of columns that contains String values
str_cols=["COUNTYNAME","STATENAME"]
# Looping through the list of String columns to convert the values to Upper case
for col in str_cols:
    toUpper(API_concat_rawDF,col)

### Transformation 6: Adding new column by extracting county number

In [19]:
# Creating a copy of the combined dataframe before adding new column
API_concat_df1=API_concat_rawDF.copy()
# Extracting county number from the CountyName column by extracting the Numbers using Regular Expressions
API_concat_df1["COUNTY"]=API_concat_df1["COUNTYNAME"].str.extract('(\d+)')

In [20]:
# Printing top 5 rows to verify the newly added column
API_concat_df1.head()

,COUNTYNAME,CRASHDATE,FATALS,PEDS,PERSONS,ST_CASE,STATE,STATENAME,TOTALVEHICLES,COUNTY
0,ST. CLAIR (115),/Date(1613185800000-0500)/,2,0,3,10001,1,ALABAMA,2,115
1,JEFFERSON (73),/Date(1613084400000-0500)/,2,0,2,10002,1,ALABAMA,1,73
2,JEFFERSON (73),/Date(1612675200000-0500)/,1,1,1,10003,1,ALABAMA,1,73
3,SHELBY (117),/Date(1612387200000-0500)/,1,0,1,10004,1,ALABAMA,1,117
4,JEFFERSON (73),/Date(1612063200000-0500)/,1,0,4,10005,1,ALABAMA,2,73

### Transformation 7: Cleansing CountyName using Regex

In [21]:
def find_match(input_str):
    """
    This function uses RegEx to match the Pattern defined and returns the matched data.
    If no match is found, values are skipped.
    """
    # If no match is found with pattern, values are skipped
    if pattern.search(input_str)==None:
        pass
    else:
        # Returns the data that matches the pattern
        return pattern.search(input_str).group()

In [22]:
# The pattern to extract the County name which can include Alphabets, Underscore and period
pattern=re.compile(r'[a-zA-Z\.\-\_ ]+')
# Inplace Replace is done on the column CountyName to identify the values that matches the Pattern
API_concat_df1["COUNTYNAME"]=API_concat_df1["COUNTYNAME"].apply(find_match)

In [23]:
# Printing 5 rows to verify the newly added column
API_concat_df1.tail()

,COUNTYNAME,CRASHDATE,FATALS,PEDS,PERSONS,ST_CASE,STATE,STATENAME,TOTALVEHICLES,COUNTY
39421,DALLAS,/Date(1639275300000-0500)/,1,1,1,484151,48,TEXAS,1,113
39422,HARRIS,/Date(1638079200000-0500)/,1,0,2,484152,48,TEXAS,2,201
39423,RUNNELS,/Date(1618696080000-0400)/,1,0,4,484153,48,TEXAS,2,399
39424,BEXAR,/Date(1622213760000-0400)/,1,0,3,484154,48,TEXAS,2,29
39425,BEXAR,/Date(1627749180000-0400)/,1,1,1,484155,48,TEXAS,1,29

### Transformation 8: Cleansing Date

In [24]:
# Defining the pattern for the default Dates in the CrashDate field.
# The value "hyphen" as first character represents invalid date, which will be defaulted in next step.
pattern2=re.compile(r'-[0-9]+-[0-9]+')

In [25]:
def find_match2(input_date):
    """
    This function will find the matching pattern of dates with hyphen in the start and return a default date.
    If no match is found, same date value is returned as the input date.
    """
    # If no matches are found, input date is returned
    if pattern2.search(input_date)==None:
        return input_date
    # If match with pattern2 is found, any of the below default dates will be picked. These are dates from 
    # last dates of the month. There are about 300 invalid dates in the entire dataset returned by the API
    else:
        # Default dates representing last dates of each month in 2021 in epoch format
        default_dates=["1612137599000-0500","1614556799000-0500","1617235199000-0500","1619827199000-0500",
               "1622505599000-0500","1625097599000-0500","1627775999000-0500","1630454399000-0500",
               "1633046399000-0500","1635724799000-0500","1638316799000-0500","1640995199000-0500"
              ]
        # A random date will be picked from above list which will be used to represent default value
        random_default_date=np.random.choice(default_dates)
        return random_default_date

In [26]:
# The find match2 function is applied to column Crash date and an inplace update is done
API_concat_df1["CRASHDATE"]=API_concat_df1["CRASHDATE"].apply(find_match2)

### Transformation 9: Converting Epoch Date to Timestamp

In [27]:
# The pattern3 represents valid date format.
pattern3='(\d+-\d+)'
# The valid dates are extracted from the CRASH date field. In place update is done
API_concat_df1["CRASHDATE"]=API_concat_df1["CRASHDATE"].str.extract(pattern3)

In [28]:
# Printing 5 rows of date after extracting and cleansing the date.
API_concat_df1.tail()

,COUNTYNAME,CRASHDATE,FATALS,PEDS,PERSONS,ST_CASE,STATE,STATENAME,TOTALVEHICLES,COUNTY
39421,DALLAS,1639275300000-0500,1,1,1,484151,48,TEXAS,1,113
39422,HARRIS,1638079200000-0500,1,0,2,484152,48,TEXAS,2,201
39423,RUNNELS,1618696080000-0400,1,0,4,484153,48,TEXAS,2,399
39424,BEXAR,1622213760000-0400,1,0,3,484154,48,TEXAS,2,29
39425,BEXAR,1627749180000-0400,1,1,1,484155,48,TEXAS,1,29

In [29]:
def convert_epoch_date(input_date):
    """
    This function is to treat the date which is in Epoch format to Timestamp format 
    and also converts to local timezone.
    """
    # The epoch date is split and then last 3 digits are ignored.
    input_date_part1=int(input_date.split("-")[0])/1000
    # The second part of the epoch date contains the timezone, which is extracted and 
    # converted to seconds by multiplying the number of hours with 3600
    input_date_part2=int(input_date.split("-")[1])/100*3600
    # The difference between the both extracted times is calculated which will then be converted to 
    # Datetime format using pandas to_datetime method
    epoch_date=input_date_part1-input_date_part2
    return pd.to_datetime(epoch_date,unit='s')

In [30]:
# COnvert to epoch function is applied to Crashdate and an inplace update is done.
API_concat_df1["CRASHDATE"]=API_concat_df1["CRASHDATE"].apply(convert_epoch_date)

### Transformation 10: Changing the timestamp format and order of columns

In [31]:
# Converting the column to datetime format
API_concat_df1["CRASHDATE"] = pd.to_datetime(API_concat_df1["CRASHDATE"])
# Changing the format of CrashDate by removing the seconds as it is not included in the data.
API_concat_df1["CRASHDATE"]=API_concat_df1["CRASHDATE"].dt.strftime('%Y-%m-%d %H:%M')

In [32]:
# Creating final dataframe by rearranging the columns which will be used to join with other dataframes
# in the final milestone to create Visualizations
API_final_df=API_concat_df1[["ST_CASE","STATE","STATENAME","COUNTY","COUNTYNAME","CRASHDATE"
                               ,"FATALS","PEDS","PERSONS","TOTALVEHICLES"]]

### Transformation 11: GroupBy and Sort Transformations

In [33]:
# Doing a group by on date to find the states with most Fatalities
API_fatals_df=API_final_df.groupby(["STATENAME"],sort=True)["FATALS"].sum().sort_values(ascending=False)
display(API_fatals_df)

STATENAME
TEXAS                   4476
CALIFORNIA              4270
FLORIDA                 3733
GEORGIA                 1794
NORTH CAROLINA          1658
                        ...
HAWAII                    94
VERMONT                   74
ALASKA                    67
RHODE ISLAND              63
DISTRICT OF COLUMBIA      41
Name: FATALS, Length: 51, dtype: int32

### Transformation 12: GroupBy and Sort Transformations on Crash Date

In [34]:
# Creating a subset Dataframe that contains Texas records
API_TX_df=API_final_df[API_final_df["STATENAME"].isin(["TEXAS"])]
# Adding a new column "Crash_Month" that includes the details of the month when the Crash occurred
API_TX_df["CRASH_MONTH"]=pd.to_datetime(API_TX_df["CRASHDATE"]).dt.strftime('%b')
# Doing a GroupBy on Crash Month and Sort in Descending to identify the 
# Months when Most crashes occurred in Texas
API_TX_df.groupby(["CRASH_MONTH"],sort=True)["FATALS"].sum().sort_values(ascending=False)
# Results suggest that August and October were deadliest months followed by December of 2021

CRASH_MONTH
Aug    416
Oct    416
Dec    408
Sep    400
Jul    395
Mar    375
Nov    370
Apr    364
May    359
Jun    357
Jan    353
Feb    263
Name: FATALS, dtype: int32

## 3. Displaying data of the final dataframe

In [35]:
# Printing top 50 columns of final Dataframe
display(API_final_df.head(50))

,ST_CASE,STATE,STATENAME,COUNTY,COUNTYNAME,CRASHDATE,FATALS,PEDS,PERSONS,TOTALVEHICLES
0,10001,1,ALABAMA,115,ST. CLAIR,2021-02-12 22:10,2,0,3,2
1,10002,1,ALABAMA,73,JEFFERSON,2021-02-11 18:00,2,0,2,1
2,10003,1,ALABAMA,73,JEFFERSON,2021-02-07 00:20,1,1,1,1
3,10004,1,ALABAMA,117,SHELBY,2021-02-03 16:20,1,0,1,1
4,10005,1,ALABAMA,73,JEFFERSON,2021-01-30 22:20,1,0,4,2
5,10006,1,ALABAMA,1,AUTAUGA,2021-01-28 12:15,1,0,3,3
6,10007,1,ALABAMA,83,LIMESTONE,2021-01-27 22:25,1,0,1,1
7,10008,1,ALABAMA,125,TUSCALOOSA,2021-01-23 02:44,1,0,2,2
8,10009,1,ALABAMA,101,MONTGOMERY,2021-01-17 00:32,1,0,2,1
9,10010,1,ALABAMA,73,JEFFERSON,2021-01-20 00:01,1,0,3,3
10,10011,1,ALABAMA,73,JEFFERSON,2021-01-15 13:25,1,0,3,2
11,10012,1,ALABAMA,43,CULLMAN,2021-01-14 19:45,1,0,4,2
12,10013,1,ALABAMA,97,MOBILE,2021-01-01 05:36,1,0,2,2
13,10014,1,ALABAMA,31,COFFEE,2021-01-01 01:08,1,1,2,1
14,10015,1,ALABAMA,73,JEFFERSON,2021-01-01 02:03,1,1,1,1
15,10016,1,ALABAMA,73,JEFFERSON,2021-01-01 02:09,1,0,1,1
16,10017,1,ALABAMA,83,LIMESTONE,2021-01-01 01:30,1,0,1,1
17,10018,1,ALABAMA,15,CALHOUN,2021-01-01 18:50,1,1,2,1
18,10019,1,ALABAMA,57,FAYETTE,2021-01-01 19:00,1,0,1,1
19,10020,1,ALABAMA,125,TUSCALOOSA,2021-01-03 08:19,1,0,1,1
20,10021,1,ALABAMA,73,JEFFERSON,2021-01-04 13:09,1,0,1,1
21,10022,1,ALABAMA,97,MOBILE,2021-01-04 18:50,1,1,1,1
22,10023,1,ALABAMA,51,ELMORE,2021-01-05 22:55,2,0,2,1
23,10024,1,ALABAMA,97,MOBILE,2021-01-05 03:50,1,0,2,1
24,10025,1,ALABAMA,59,FRANKLIN,2021-01-06 07:45,1,0,2,2
25,10026,1,ALABAMA,31,COFFEE,2021-01-06 18:15,1,0,4,2
26,10027,1,ALABAMA,81,LEE,2021-01-06 18:25,1,0,5,3
27,10028,1,ALABAMA,43,CULLMAN,2021-01-06 23:00,1,0,2,2
28,10029,1,ALABAMA,31,COFFEE,2021-01-06 23:45,1,0,1,1
29,10030,1,ALABAMA,79,LAWRENCE,2021-01-07 07:05,1,0,3,2
30,10031,1,ALABAMA,127,WALKER,2021-01-07 16:53,1,0,1,1
31,10032,1,ALABAMA,103,MORGAN,2021-01-07 15:24,1,0,4,2
32,10033,1,ALABAMA,73,JEFFERSON,2021-01-08 10:13,1,0,1,1
33,10034,1,ALABAMA,121,TALLADEGA,2021-01-08 13:18,1,0,1,1
34,10035,1,ALABAMA,109,PIKE,2021-01-08 10:50,1,0,2,1
35,10036,1,ALABAMA,97,MOBILE,2021-01-08 20:00,1,0,1,1
36,10037,1,ALABAMA,97,MOBILE,2021-01-08 23:30,2,0,3,2
37,10038,1,ALABAMA,115,ST. CLAIR,2021-01-09 02:01,1,0,2,1
38,10039,1,ALABAMA,1,AUTAUGA,2021-01-09 13:47,1,0,4,2
39,10040,1,ALABAMA,85,LOWNDES,2021-01-10 00:32,1,0,1,1
40,10041,1,ALABAMA,117,SHELBY,2021-01-10 19:40,1,0,1,1
41,10042,1,ALABAMA,49,DEKALB,2021-01-10 16:30,1,1,2,2
42,10043,1,ALABAMA,97,MOBILE,2021-01-10 19:53,1,0,2,2
43,10044,1,ALABAMA,117,SHELBY,2021-01-11 12:15,1,0,1,1
44,10045,1,ALABAMA,103,MORGAN,2021-01-14 11:36,1,0,1,1
45,10046,1,ALABAMA,81,LEE,2021-01-15 16:51,1,0,2,2
46,10047,1,ALABAMA,89,MADISON,2021-01-16 02:10,1,0,1,1
47,10048,1,ALABAMA,131,WILCOX,2021-01-16 20:00,1,0,2,1
48,10049,1,ALABAMA,89,MADISON,2021-01-16 18:16,1,1,1,1
49,10050,1,ALABAMA,15,CALHOUN,2021-01-17 19:57,1,1,1,1

## 4. Ethical Implications

##### a. Maximum number of vehicles involved in the accident is restricted to six vehicles. Hence, this study does not include crashes that involved more than 6 vehicles and pileups. This should be taken into consideration while deriving conclusions from the research.
##### b. All the rows in the dataset represents the crashes that had atleast one fatality. Hence the research does not include the details of non-fatal accidents. The grim results  of this research must be studied with empathy.
##### c. Some crashes did not had include the time of crash and hence they were replaced with default values. There were about 300 such instances. Hence, the results cannot be derived only based on the time of crash as about 1% of data contains default values.

In [36]:
API_final_df.to_excel('formatted_APIdata_df.xlsx')